Revit 2027 API
ConcreteSealantType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteSealant" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConcreteSealantType
Public Enumeration ConcreteSealantType
public enum class ConcreteSealantType
type ConcreteSealantType
Members
Member name | Value | Description
Acrylic | 2
Epoxy | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace